SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-61973-A

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( FDB_K3_61973.s )
Size  ( 2.718m 3.79m 10.2m )
Mass ( 71.7t-uk )
WheelRadius ( 19in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 0cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 209kN )   Comment (* braked at 70% of mass on driving wheels 65.5t, coefficient of friction 0.5 *)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)
MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )
MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.9m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 13.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 6237 )
ORTSDavis_B ( 23.97 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 4
Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( -0.55 3.25 -4.15 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.5 )
     )
    )
   )
Light	(
   comment( Glowing Firebox )
   Type		( 0 )
   Conditions	(
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn	( 0.5 )
   FadeOut	( 0.5 )
   Cycle	( 0 )
   States	(	2
   State	(
   Duration ( 0.5 )
   LightColour ( eeff8800 )
   Position ( 0 2.15 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.0 )
   )
   State	(
   Duration ( 0.3 )
   LightColour ( ffff8855 )
   Position ( 0 2.15 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.05 )
	  )
      )
   )
Light (
   comment( Head light Position B )
    Type  ( 0 )
    Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.1 )
    LightColour ( ccdddddd )
    Position ( 0.995 1.425 4.76 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
    )
    State (
    Duration ( 0.01 )
    LightColour ( eeffffff )
    Position ( 0.995 1.425 4.76 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
      )
    )
   )
Light (
   comment( Head light Position D )
    Type  ( 0 )
    Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
    FadeIn ( 0.05 )
    FadeOut ( 0.05 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.1 )
    LightColour ( ccdddddd )
    Position ( -0.995 1.425 4.76 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
    )
    State (
    Duration ( 0.1 )
    LightColour ( eeffffff )
    Position ( -0.995 1.425 4.76 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
      )
    )
   )
 )
	
Comment( ******* Miscellaneous Wagon Information************ )


Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( FDB_K3_61973.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.7 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17eng.sms" )
)

Engine ( OR-61973-A

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
			-0.3 3.90 -3.5
				0 1 0
				0.15
			)
			SafetyValvesFX
			(
			0 3.885 -2.825
				0 1 0
				0.35
			)
			StackFX
			(
			0 3.75 3.20
				0 1 0
				0.3
			)
			StackFX
			(
			0 3.80 3.20
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)
			
			Injectors2FX
			(
				-1.1 1.1 -4.9
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.1 1.1 -4.9
				0 -1 0
				0.11
			)
      		Comment ( == Cylinder - Right == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				-1.083 0.6 3.1
				0 -0.577 1
				0.13
			)
      		Comment ( == Cylinder - Right == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				-1.083 0.6 2.4
				0 -0.577 1
				0.13
			)
      		Comment ( == Cylinder - Left == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				1.083 0.6 3.1
				0 -0.577 1
				0.13
			)
      		Comment ( == Cylinder - Left == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				1.083 0.6 2.4
				0 -0.577 1
				0.13
			)
		)
	)

Wagon ( OR-61973-A )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 34in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 60t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 251ft^3 )  
ORTSEvaporationArea ( 1901ft^2 )
ORTSSuperheatArea ( 400ft^2 )
MaxBoilerPressure ( 180psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 18.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 28ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 7.5t-uk )
MaxTenderWaterMass ( 42000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )


Comment(ORTSMaxIndicatedHorsepower ( 1419.0hp ))   

ORTSBoilerEfficiency( 0.0 0.92  170.0 0.46 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector( 0 1 0.1 0.55 )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( K3.cvf )
HeadOut (  -1.423 3.0 -3.7 )
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17cab.sms" )
Name ( "61973 K3, Express Passenger, TE 30Klbf" )
Description (
"Although very similar to the K1s and K2s, the K3s looked different due to their large diameter boilers and stout boiler mountings. The cab continued the austere style started by Ivatt. No side windows were provided, but a 1ft 6in deep side cut-out was provided as a driver look out. The roof also extended back 9in over the cab entrance. Later batches of K3s would introduce side windows and padded seats to the design.
The first ten locomotives (Nos. 1000-9) were constructed between 1920 and 1921. Their advent coincided with the coal strike of 1921. Although intended for fast goods work, the strike meant they they were often used on express passenger services as an economy measure. The K3s managed this very well, and quickly made a name for themselves hauling trains up to twenty bogies in size.
Jazz music was just becoming popular in Britain at that time, and they quickly earned the name of "Jazzers" due to their syncopated exhaust beat and uneven gyratory movement at the rear. The exhaust beat was a side-effect of the three cylinder design, and would become a common sound with the advent of further Gresley types. The poor riding, however, would pose problems for maintenance.
Throughout their lives, the K3s had a reputation for very rough riding. There were many reports of cab bolts being shaken loose, and both engine and tender dragbox damage was not unusual.
K3s were used to operate two fast weekday coal trains from Peterborough to Ferme Park Yard (Hornsey) The slow coal trains along this line were causing serious line occupancy problems, and the new services were an attempt to ease the situation. Loads were limited to fifty-six 10 ton wagons. At the same time, Doncaster K3s also operated a similar coal service from Doncaster to Peterborough."
)
)
